app/views/cdls/list.html.erb

      <td class="center"><%= status_tag(cdl.skills_test) %></td>
      <td class="center"><%= button_to("#{cdl.trips.map {|t| t.total}[0]} of 8", :controller => 'trips', :action => 'show', :cdl_id => cdl.id) %></td>
---
SELECT "trips".* FROM "trips" WHERE ("trips".cdl_id = 1)