app/controllers/cdls_controller.rb

SELECT "cdls".* FROM "cdls" ORDER BY cdls.position ASC
---
  def list
    @cdls = Cdl.order("cdls.position ASC")

SELECT "cdls".* FROM "cdls" WHERE "cdls"."id" = 1 LIMIT 1
---
  def show
    @cdl = Cdl.find(params[:id])

SELECT COUNT(*) FROM "cdls"
---
  def new
    @cdl = Cdl.new
    @cdl_count = Cdl.count + 1

INSERT INTO "cdls" ("admin_user_id", "position", "physical", "general_knowledge", "air_brakes", "passenger", "school", "skills_test", "created_at", "updated_at") VALUES (NULL, NULL, 'f', 'f', 'f', 'f', 'f', 'f', '2011-04-05 21:12:35.000773', '2011-04-05 21:12:35.000773') RETURNING "id"
SELECT COUNT(1) FROM "cdls"
---
  def create
    # Instantiate a new object using form parameters
    @cdl = Cdl.new(params[:cdl])
    # Save the object
    if @cdl.save
      # If save succeeds, redirect to the list action
      flash[:notice] = "Prospect created."
      redirect_to(:action => 'list')
    else
      # If save fails, redisplay the form so user can fix problems
      @cdl_count = Cdl.count +1

SELECT "cdls".* FROM "cdls" WHERE "cdls"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "cdls"
---
  def edit
    @cdl = Cdl.find(params[:id])
    @cdl_count = Cdl.count

SELECT "cdls".* FROM "cdls" WHERE "cdls"."id" = 1 LIMIT 1
UPDATE "cdls" SET "admin_user_id" = 1, "general_knowledge" = 't', "air_brakes" = 't', "passenger" = 't', "school" = 't', "updated_at" = '2011-04-05 21:26:50.201889' WHERE "cdls"."id" = 1
---
  def update
    # Find object using form parameters
    @cdl = Cdl.find(params[:id])
    # Update the object
    if @cdl.update_attributes(params[:cdl])

SELECT "cdls".* FROM "cdls" WHERE "cdls"."id" = 1 LIMIT 1
---
  def delete
    @cdl = Cdl.find(params[:id])

DELETE FROM "cdls" WHERE "cdls"."id" = 1
SELECT "cdls".* FROM "cdls" WHERE "cdls"."id" = 1 LIMIT 1
---
  def destroy
    Cdl.find(params[:id]).destroy