app/controllers/pages_controller.rb

  def list
    @pages = Page.order("pages.position ASC")
---
SELECT "pages".* FROM "pages" ORDER BY pages.position ASC

  def show
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1

  def new
    @page = Page.new
    @pages_count = Page.count + 1
---
SELECT COUNT(*) FROM "pages"

  def create
    # Instantiate a new object using form parameters
    @page = Page.new(params[:page])
    # Save the object
    if @page.save
      # If save succeeds, redirect to the list action
      flash[:notice] = "Page created."
      redirect_to(:action => 'list')
    else
      # If save fails, redisplay the form so user can fix problems
      @pages_count = Page.count + 1
---
INSERT INTO "pages" ("subject_id", "name", "permalink", "position", "visible", "created_at", "updated_at") VALUES (NULL, 'Dillon', NULL, 8, 'f', '2011-04-04 18:13:35.016058', '2011-04-04 18:13:35.016058') RETURNING "id"
SELECT COUNT(*) FROM "pages"

  def edit
    @page = Page.find(params[:id])
    @pages_count = Page.count
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 2 LIMIT 1
SELECT COUNT(*) FROM "pages"

  def update
    # Find object using form parameters
    @page = Page.find(params[:id])
    # Update the object
    if @page.update_attributes(params[:page])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 2 LIMIT 1
UPDATE "pages" SET "subject_id" = 17, "permalink" = '', "position" = 3, "updated_at" = '2011-04-05 15:45:00.887804' WHERE "pages"."id" = 3

  def delete
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1

  def destroy
    Page.find(params[:id]).destroy
---
DELETE FROM "pages" WHERE "pages"."id" = 5
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 5 LIMIT 1