app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" ORDER BY sections.position ASC
---
  def list
    @sections = Section.order("sections.position ASC")

SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
---
  def show
    @section = Section.find(params[:id])

SELECT COUNT(*) FROM "sections"
---
  def new
    @section = Section.new
    @section_count = Section.count + 1

INSERT INTO "sections" ("page_id", "name", "position", "visible", "content_type", "content", "created_at", "updated_at") VALUES (2, '', 3, 't', '', '', '2011-04-05 15:53:04.119082', '2011-04-05 15:53:04.119082') RETURNING "id"
SELECT COUNT(*) FROM "sections"
---
  def create
    @section = Section.new(params[:section])
    if @section.save
      flash[:notice] = "Section created."
      redirect_to(:action => 'list')
    else
      @section_count = Section.count + 1

SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
---
  def edit
    @section = Section.find(params[:id])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
UPDATE "sections" SET "name" = 'firster', "position" = 3, "content" = 'please tell me what you think', "updated_at" = '2011-04-04 18:24:14.103691' WHERE "sections"."id" = 1
---
  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(params[:section])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
---
  def delete
    @section = Section.find(params[:id])

DELETE FROM "sections" WHERE "sections"."id" = 4
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 4 LIMIT 1
---
  def destroy
    Section.find(params[:id]).destroy