app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects" ORDER BY subjects.position ASC
---
  def list
    @subjects = Subject.order("subjects.position ASC")

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 3 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

SELECT COUNT(1) FROM "subjects"
---
  def new
    @subject = Subject.new
    @subject_count = Subject.count + 1

INSERT INTO "subjects" ("name", "position", "visible", "created_at", "updated_at") VALUES ('efaulr', 34, 'f', '2011-04-01 21:05:00.746688', '2011-04-01 21:05:00.746688') RETURNING "id"
SELECT COUNT(1) FROM "subjects"
---
  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(params[:subject])
    # Save the object
    if @subject.save
      # If save succeeds, redirect to the list action
      flash[:notice] = "Subject created."
      redirect_to(:action => 'list')
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count = Subject.count +1

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 2 LIMIT 1
SELECT COUNT(*) FROM "subjects"
---
  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 2 LIMIT 1
UPDATE "subjects" SET "name" = 'super bad', "position" = 4, "updated_at" = '2011-04-04 16:25:46.719792' WHERE "subjects"."id" = 2
---
  def update
    # Find object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(params[:subject])

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1
---
  def delete
    @subject = Subject.find(params[:id])

DELETE FROM "subjects" WHERE "subjects"."id" = 19
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 19 LIMIT 1
---
  def destroy
    Subject.find(params[:id]).destroy