app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips" ORDER BY trips.position ASC
---
  def list
    @trips = Trip.all

SELECT "trips".* FROM "trips" WHERE "trips"."cdl_id" IS NULL LIMIT 1
---
  def show
    #@driver = Cdl.find(params[:id])
    @trip = Trip.find_by_cdl_id(params[:cdl_id])

SELECT COUNT(*) FROM "trips"
---
  def new
    @trip = Trip.new
    @trip_count = Trip.count + 1

INSERT INTO "trips" ("cdl_id", "cdl_name", "empty_1", "empty_2", "empty_3", "empty_4", "full_1", "full_2", "full_3", "full_4", "created_at", "updated_at") VALUES (NULL, '1', 't', 't', 't', 'f', 'f', 'f', 'f', 'f', '2011-04-06 14:29:10.354294', '2011-04-06 14:29:10.354294') RETURNING "id"
---
  def create
    # Instantiate a new object using form parameters
    @trip = Trip.new(params[:trip])
    # Save the object
    if @trip.save

SELECT "trips".* FROM "trips" WHERE "trips"."id" = 7 LIMIT 1
---
  def edit
    @trip = Trip.find(params[:id])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = 7 LIMIT 1
UPDATE "trips" SET "total" = 6, "empty_3" = 'f', "empty_4" = 'f', "full_1" = 'f', "full_2" = 'f', "full_3" = 'f', "updated_at" = '2011-04-06 16:55:27.157135' WHERE "trips"."id" = 7
---
  def update
    # Find object using form parameters
    @trip = Trip.find(params[:id])
    # Update the object
    if @trip.update_attributes(params[:trip])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = 1 LIMIT 1
---
  def delete
    @trip = Trip.find(params[:id])

DELETE FROM "trips" WHERE "trips"."id" = 1
SELECT "trips".* FROM "trips" WHERE "trips"."id" = 1 LIMIT 1
---
  def destroy
    Trip.find(params[:id]).destroy